{
  "questions": [
    {
      "id": 1,
      "section": "Governance and Integration Strategy",
      "text": "I need a PID provider that offers cost-effective options for registering large numbers of PIDs.",
      "help": "For institutions managing many digital objects, cost-efficient PID registration is essential. Some PID providers offer volume-based discounts, non-profit rates, or fee waivers for specific communities."
    },
    {
      "id": 2,
      "section": "Governance and Integration Strategy",
      "text": "I want a PID that comes with open metadata for re-use.",
      "help": "Open metadata enhances discoverability and reuse."
    },
    {
      "id": 3,
      "section": "Governance and Integration Strategy",
      "text": "I want a PID where persistence is guaranteed with an organisation.",
      "help": "Persistence is the core promise of a PID - but it’s not guaranteed by the technology alone. It depends on long-term organizational and financial commitment. Systems like <strong>DataCite DOIs</strong>, <strong>ePIC handles</strong>, and <strong>URN:NBN</strong> are backed by stable institutions/organizations that explicitly commit to maintaining resolvability over time. <strong>Handles</strong> and <strong>ARKs</strong> can also support persistence, but this varies with the implementation. <strong>Wikidata IDs</strong> are maintained by a large community under the Wikimedia Foundation, offering stability through collective stewardship."
    },
    {
      "id": 4,
      "section": "Governance and Integration Strategy",
      "text": "I want to use my PIDs to point directly to objects, not metadata or landing pages.",
      "help": "This is useful when the object itself must be immediately accessible, e.g., raw files or visual artefacts."
    },
    {
      "id": 5,
      "section": "Governance and Integration Strategy",
      "text": "My organisation does not have the IT capacity to implement Persistent Identifiers in our systems (e.g. collection registration system, website or repository system).",
      "help": "Some PID providers offer tools or services for lightweight integration."
    },
    {
      "id": 6,
      "section": "Governance and Integration Strategy",
      "text": "I want to use a PID provider with transparent information on membership.",
      "help": "Clear governance structures promote sustainability and openness."
    },
    {
      "id": 7,
      "section": "Governance and Integration Strategy",
      "text": "I want to use a PID provider with transparent information on fees.",
      "help": "Transparent fees help to plan and assess long-term PID use."
    },
    {
      "id": 8,
      "section": "Governance and Integration Strategy",
      "text": "I want to have the possibility to delete my PID.",
      "help": "Some use cases require deletable PIDs; others require permanent references."
    },
    {
      "id": 9,
      "section": "Governance and Integration Strategy",
      "text": "I want a centralised system with a central organisation to take care of persistence.",
      "help": "Centralisation can simplify responsibility and oversight."
    },
    {
      "id": 10,
      "section": "Governance and Integration Strategy",
      "text": "I want a decentralised system.",
      "help": "Decentralised systems can offer more autonomy and resilience."
    },
    {
      "id": 11,
      "section": "Metadata & Interoperability",
      "text": "I want a PID system that comes with a standardised metadata schema.",
      "help": "Standards enable interoperability and metadata harvesting."
    },
    {
      "id": 12,
      "section": "Metadata & Interoperability",
      "text": "I need a PID system that allows flexible configuration of metadata.",
      "help": "Flexibility supports the needs of different domains or workflows."
    },
    {
      "id": 13,
      "section": "Metadata & Interoperability",
      "text": "I want to use a PID system with a generic metadata schema to support broad findability.",
      "help": "Generic metadata makes it easier to aggregate and index PIDs."
    },
    {
      "id": 14,
      "section": "Metadata & Interoperability",
      "text": "I want a PID system that provides interoperability across entity types and domains.",
      "help": "Cross-domain compatibility ensures reusability and data exchange."
    },
    {
      "id": 15,
      "section": "Metadata & Interoperability",
      "text": "I want to use a PID system that allows entry of discipline- or object-specific metadata.",
      "help": "Specific metadata improves precision in discovery."
    },
    {
      "id": 16,
      "section": "Metadata & Interoperability",
      "text": "I want a PID that comes with machine-readable metadata.",
      "help": "Machine-readable metadata is essential for automation and indexing."
    },
    {
      "id": 17,
      "section": "Metadata & Interoperability",
      "text": "I want a PID that provides human-readable metadata on a landing page.",
      "help": "Human-readable landing pages support understanding and reuse."
    },
    {
      "id": 18,
      "section": "Metadata & Interoperability",
      "text": "I want to use my PID to point directly to the individual entities.",
      "help": "This is useful for unpublishable or highly granular internal data."
    },
    {
      "id": 19,
      "section": "Technical Implementation",
      "text": "I want to use a PID Provider that offers an API to register PIDs.",
      "help": "APIs allow for integration with automated workflows."
    },
    {
      "id": 20,
      "section": "Technical Implementation",
      "text": "I want to use a PID Provider that offers manual PID registration.",
      "help": "Manual registration can support flexibility and individual workflows."
    },
    {
      "id": 21,
      "section": "Technical Implementation",
      "text": "I want to use existing plugins for registering PIDs to ease integration in our own system.",
      "help": "Plugins and tools can simplify integration and reduce effort."
    },
    {
      "id": 22,
      "section": "Technical Implementation",
      "text": "I want to run my own server to register PIDs for more flexibility and decentralized PID management.",
      "help": "Self-hosting provides control but requires technical capacity."
    }
  ]
}
