{
  "questions": [
    {
      "id": 1,
      "section": "Persistence and Costs",
      "text": "1. It is important for us that the PID provider demonstrates a strong, long-term commitment to persistence.",
      "help": " 1. Persistence is the core promise of a PID - but it’s not guaranteed by the technology alone. It depends on long-term organizational and financial commitment. Systems like DataCite DOIs, ePIC Handles, and URN:NBN:DE are backed by stable institutions/organizations that explicitly commit to maintaining resolvability over time. ARKs can also support persistence, but this varies with the implementation, especially as ARKs need to be hosted by the assigning institution."
    },
    {
      "id": 2,
      "section": "Persistence and Costs",
      "text": "2. It is important for us that the PID system allows flexible PID lifecycles, including deletion or deactivation where appropriate.",
      "help": "While many PID systems are designed for long-term reference and persistence, some use cases - especially during early research phases or for internal workflows - may require the option to delete or deactivate PIDs. ARKs support flexible lifecycles, including deletion and the definition of a persistence policy (e.g., how long a identifier will be available) for the PIDs of a namespace. In contrast, DataCite DOIs, ePIC Handles, and URN:NBN:DE are designed to be permanent and generally do not support deletion. Instead, it is possible and considered good practice to set a tombstone for an object that is not available anymore, such that at least the metadata is still available. Whether different persistence policies and deletion are allowed depends on the provider’s policies and the intended role of the PID."
    },
    {
      "id": 3,
      "section": "Persistence and Costs",
      "text": "3. The ability to assign PIDs at low cost is one of the most important criteria when choosing a PID provider.",
      "help": "When registering PIDs, different types of costs can occur for the registering institution: 1) Membership fees or fees per registered PID: When registering many PIDs (e.g. more than 100k identifiers per year), costs can quickly accumulate. Some PID providers, such as URN:NBN:DE and ARK, offer free models that support large-scale usage. Others, like DataCite DOIs and ePIC Handles, have tiered pricing or institutional membership models, which scale more or less strongly with the total number of PIDs registered and end up at different pre-defined upper cost bounds. Choosing a cost-effective provider is especially important when you plan to register many PIDs over time. 2) Costs for hosting PID infrastructure: ARKs require self-hosting of the PID infrastructure, which incurs significant personal and material costs for setting up and maintaining PID infrastructure."
    },
    {
      "id": 4,
      "section": "Purpose",
      "text": "4. It is important for us that our identifiers are globally recognized in scholarly publishing with stable citation practices.",
      "help": "If it is important for your institution that the identifiers used are globally recognized in scholarly publishing with stable citation practices, DataCite DOIs are the most suitable choice. They have strong, well-established support across publishers, citation styles, and research indexing services. Other identifiers such as ePIC Handles, ARKs, and URNs offer persistence but are not as universally accepted and integrated for formal scholarly citation."
    },
    {
      "id": 5,
      "section": "Purpose",
      "text": "5. It is important for us that my PID supports early PID adoption (especially, a PID should be minted before publishing the digital object).",
      "help": "Early PID adoption means assigning persistent identifiers at the earliest stages of research asset creation, often while data is being generated or processed, before formal publication. Assigning PIDs early facilitates collaboration by enabling referencing of in-progress datasets or materials, allows early metadata capture, and ensures persistent connection between related outputs through the research workflow. ePIC Handles, ARKs, and DataCite DOIs support early PID assignment in the research data lifecycle, including pre-publication phases. In comparison, URN:NBN:DE are assigned when the digital object is published."
    },
    {
      "id": 6,
      "section": "Purpose",
      "text": "6. It is important for us that my PIDs can be assigned to high-granular entities (e.g., parts of data within files or containers such as text excerpts, parts of images, variables, etc).",
      "help": "If your PID use-case requires PID adoption on a relatively fine-grained level, you might first consider to assign ARKs or ePIC Handles. Often when PIDs are registered for high-granular data, the number of PIDs assigned is high and costs can quickly accumulate, e.g. for DOI. Also, ARKs and Handles offer technical features (suffix passthrough/template Handles) that allow to append paramteres to the PID during resolution to change or extend the resolution URL. Although not offering these specified features, DataCite DOIs are also generally capable of identifying high-granular entities, whereas URN:NBN:DEs are not used for high-granular entities."
    },
    {
      "id": 7,
      "section": "Purpose",
      "text": "7. It is important for us that the PID provider supports cataloging, archiving, and stable referencing within national or academic library infrastructures.",
      "help": "URN:NBN:DE are specialized persistent identifiers designed primarily for use by national libraries and archival institutions. It provides stable, location-independent naming of digital and physical resources that often lack other standard identifiers like ISBN or ISSN. URN:NBN:DEs supports comprehensive cataloging and long-term archival needs by uniquely identifying materials such as digitized manuscripts, reports, cultural heritage objects, and institutional publications within library collections. They are collected and discoverable in the central catalog of the German National Library"
    },
    {
      "id": 8,
      "section": "Metadata & Interoperability",
      "text": "8. It is important for us to work with a PID provider that offers full control on the PID metadata. That is, we can define all metadata fields ourselves, including whether the fields are openly accessible/private, mandatory/optional.",
      "help": "Some PID providers (e.g., DataCite DOIs) define a metadata schema that needs to be adopted when working with the PID Provider. A standardized metadata schema fixes a limited number of pre-defined fields that are to be filled in by the user when registering a PID. Standardized metadata schemas enable interoperability between systems and metadata harvesting. Other PID providers (e.g., ePIC, ARK) do not fix the metadata schema in advance. The infrastructure administrator can define the metadata schema that defines the PID metadata fields according to his needs. Flexibility supports adjusting to use-case specific needs of different domains or workflows. Not only the fields themselves can be freely defined, but also whether metadata fields should be mandatory or optional and whether they should be publicly available or private to restricted sets of users. URN:NBN:DEs themselves are pure identifier schemes that do not define or mandate any metadata schema. Metadata associated with URN:NBN:DE-identified resources is managed externally in library catalogs, archives, or domain-specific repositories, using independent metadata standards."
    },
    {
      "id": 9,
      "section": "Metadata & Interoperability",
      "text": "9. It is important for us to work with a PID provider with a widely used/recognized standardized metadata schema.",
      "help": "Working with a PID provider that mandates a widely adopted and standardized metadata schema ensures consistency in how data is described and shared across different systems and organizations. This uniformity enables interoperability, supports automated processing and research workflows, and enhances metadata quality and compliance with regulations. DataCite defines a widely used, standardized metadata schema for research data and scholarly outputs. URN:NBN:DE defines a national schema that is applied by the DNB catalog but also allows institutions to define their own metadata requirements for external library catalogs, archives, or domain-specific repositories in use. Other PID providers (ePIC, ARK) give the possibility of flexible metadata configurations (see last statement)."
    },
    {
      "id": 10,
      "section": "Metadata & Interoperability",
      "text": "10. It is important for us that the PID provider offers additional metadata services on top of simple PID registration, such as metadata tooling, statistics, and visualisation.",
      "help": "Some PID providers, such as DataCite DOI, offer a range of services on top of simple PID registration. These additional services may include: 1) Extensive metadata tooling for enriching and managing PID-related metadata. 2) Statistics and visualizations to track PID usage, citations, and connections. - These enhanced services provide features that can improve discovery, management, and outreach. Other PID providers (such as ePIC Handles, URN:NBN:DE, ARK) do not offer similar extensive metadata tooling features."
    },
    {
      "id": 11,
      "section": "Technical Setup and Training",
      "text": "11. It is important for us to have the freedom to choose what kind of location our PIDs resolve to (that is, our PIDs should not just resolve to human-readable landing pages, but some PIDs should also resolve to digital resources directly, or to machine-readable metadata records).",
      "help": "Different PIDs by default may resolve to different kinds of resources. Some PIDs resolve to landing pages with human readable metadata, others resolve to a set of machine readable metadata or directly to the research entity (e.g., a file). Some PID systems (such as DataCite DOIs) require that the PID resolves to a landing page which must contain human-readable metadata. Other PID types (e.g. ePIC PID, ARKs, URN:NBN:DE) are allowed to resolve to whatever URL the user requires. Resolving directly to an object may be reasonable if, for example, many (high-granular) data are generated during the research process which might not be published in the end, but still receive a PID that points to the raw data."
    },
    {
      "id": 12,
      "section": "Technical Setup and Training",
      "text": "12. It is important for us to self-host our PID resolver/infrastructure in-house.",
      "help": "Hint: This and the following statement exclude each other. Hence, you might not want to choose “Very important” for both statements simultaneously. Self-hosting can provide higher performance and more technical options but requires technical capacity. Self-hosting can make sense if performance is critical, for example, if lots of PIDs should be registered within a very short time frame. The closer the client to the server, the more performant is PID registration. Self-hosting can also make sense if a PID service should follow a specific technical setup (e.g., a specific database-engine under the Handle System, which fits a specific purpose, or more RAM for fast queries). Another reason could be specialized solutions for user management. For ePICs, ARKs and URN:NBN:DE, there is the option to self-host the PID resolver/infrastructure. Other providers such as DataCite are centrally managed and do not provide the option of self-hosting."
    },
    {
      "id": 13,
      "section": "Technical Setup and Training",
      "text": "13. On the contrary, it is important for us that we do NOT self-host any PID resolver/infrastructure.",
      "help": "Self-hosting can provide higher performance and more technical options but requires technical capacity and available staff. Self-hosting also demands long-term commitment to maintaining the services to guarantee for persistence. ARKs require self-hosting because there are currently no ARK service providers available in Germany. The infrastructure for ePIC Handles, DataCite DOIs and URN:NBN:DE can be all hosted by service providers, hence, no self-hosting is required."
    },
    {
      "id": 14,
      "section": "Technical Setup and Training",
      "text": "14. It is important for us that the PID provider offers extensive training material.",
      "help": "Training resources and user support can make a big difference, especially during onboarding or when integrating PIDs into institutional workflows. DataCite offers extensive documentation, webinars, community calls, and helpdesk support. ARKs, URN:NBN:DE and ePIC Handles are supported through technical documentation and user communities, but additional training offers are limited. ARKs provide rich information through their website, including best practices, presentations and video tutorials. URN systems usually depend on national libraries, where training and support may be limited or targeted to specific institutional partners."
    }
  ]
}
